In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 30, 35, 40, 22],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Salary": [50000, 60000, 75000, 80000, 45000]
}

In [4]:
df = pd.DataFrame(data)
print(df["Name"])

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [5]:
df.loc[0]

Name         Alice
Age             25
City      New York
Salary       50000
Name: 0, dtype: object

In [7]:
df.loc[1:3]

      Name  Age         City  Salary
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   80000

In [8]:
df.iloc[2]

Name      Charlie
Age            35
City      Chicago
Salary      75000
Name: 2, dtype: object

In [9]:
df.iloc[1:4,[0,2]]

      Name         City
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

In [10]:
df[df["Age"]>30]

      Name  Age     City  Salary
2  Charlie   35  Chicago   75000
3    David   40  Houston   80000

In [19]:
df[(df["Age"]>30) & (df["Salary"]>60000)]

      Name  Age     City  Salary
2  Charlie   35  Chicago   75000
3    David   40  Houston   80000

In [22]:
df[(df["City"] == "New York") | (df["Salary"] > 70000)]

      Name  Age      City  Salary
0    Alice   25  New York   50000
2  Charlie   35   Chicago   75000
3    David   40   Houston   80000

In [23]:
df[df["City"].isin(["New York", "Chicago"])]

      Name  Age      City  Salary
0    Alice   25  New York   50000
2  Charlie   35   Chicago   75000

In [24]:
df[df["Name"].str.contains("a",case = False)]

      Name  Age      City  Salary
0    Alice   25  New York   50000
2  Charlie   35   Chicago   75000
3    David   40   Houston   80000

In [25]:
df.loc[df["Age"]>30 , ["Name","Salary"]]

      Name  Salary
2  Charlie   75000
3    David   80000

In [26]:
df[df["Salary"] == df["Salary"].min()]

  Name  Age     City  Salary
4  Eve   22  Phoenix   45000

In [ ]:
df["column"]	                         Select a single column
df[["col1", "col2"]]	                 Select multiple columns
df.iloc[]	                             Select by position (integer index)
df.loc[]	                             Select by label (index name)
df[df["column"] > value]	             Filter based on condition
df[(condition1) & (condition2)]	         Filter with multiple conditions (&, `
df[df["column"].isin([...])]	         Filter rows where values match a list
df[df["column"].str.contains("text")]	 Filter rows where column contains a substring